
<img src="https://i.ibb.co/8j8c78C/C-pia-de-C-pia-de-Web-bootcamp-1.png" width="100%">

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 1
#### Liste as diferenças entre uma lista, um dicionário, um array numpy e uma series pandas?
<hr>

- Lista:
  - Lista é uma estrutura de dado que armazena um conjunto ordenado de valores, onde cada valor é identificado por um index. Além disso, as listas possuem as características de serem mutáveis e heterogêneas.

- Dicionário:
  - Dicionário é uma estrutura de dado que armazena um conjunto não ordenado de elementos, onde cada elemento possui uma chave atrelada a ele. Além disso, os dicionários possuem as características de serem heterogêneos e imutáveis.
  
- Array Numpy:
  - A Array Numpy é uma estrutura de dado bem similar as tradicionais listas do Python, no entanto, possui a caracterísitca de ser homogênea e realizar operações com arrays de maneira bem mais eficiente, através da computação vetorizada.
  
- Series Pandas:
   - A Series Pandas é uma estrutura de dado rótulada, unidimensional e homogênea capaz de armazenar qualquer tipo de dado. De modo geral, a series consiste em um array de dados e um array de rótulos (chamado também de array de indexes ou índices).

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 2
#### Reformule a série a seguir em um dataframe com 7 linhas e 5 colunas.
`ser = pd.Series(np.random.randint(1, 10, 35))`
<hr>

In [1]:
import pandas as pd
import numpy as np
ser = pd.Series(np.random.randint(1, 10, 35))
ser

0     6
1     5
2     8
3     9
4     1
5     3
6     8
7     2
8     4
9     1
10    3
11    3
12    9
13    8
14    8
15    1
16    6
17    5
18    2
19    2
20    1
21    9
22    3
23    3
24    8
25    3
26    4
27    3
28    8
29    5
30    8
31    4
32    1
33    7
34    8
dtype: int64

In [2]:
#reformulando o pandas series
df = pd.DataFrame(ser.values.reshape(7, 5))
df

   0  1  2  3  4
0  6  5  8  9  1
1  3  8  2  4  1
2  3  3  9  8  8
3  1  6  5  2  2
4  1  9  3  3  8
5  3  4  3  8  5
6  8  4  1  7  8

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 3
#### Importe as colunas ’crim’ e ’medv’ do conjunto de dados do BostonHousing como um dataframe.

<hr>

In [3]:
url = "https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv"
df = pd.read_csv(url, usecols=["crim", "medv"])
df.head()

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 4
#### Renomeie a coluna Type como CarType em df e substitua o ’.’ nos nomes das colunas com ’_’.

<hr>

In [4]:
url = "https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv"
df = pd.read_csv(url)

#alterando as colunas
df.rename(columns={"Type": "CarType"}, inplace=True)
df.columns = df.columns.str.replace(".", "_")

#printar colunas alteradas
df.columns

Index(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',
       'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
       'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 5
#### Verifique se o dataframe tem algum valor ausente.
`pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')`

<hr>

In [5]:
url = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
df = pd.read_csv(url)

#verificando se o dataframe tem algum valor ausente:
tem_ausente = df.isnull().values.any()

print("Tem valor ausente?", tem_ausente)
if(tem_ausente):
    #soma da quantidade total de dados ausentes
    qtd_ausentes = df.isnull().sum().sum()
    print("Quantidade total de dados ausentes:", qtd_ausentes)

Tem valor ausente? True
Quantidade total de dados ausentes: 138

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 6
#### Conte o número de valores ausentes em cada coluna do df . Qual coluna tem o número máximo de valores ausentes?
`pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')`
<hr>

In [6]:
url = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
df = pd.read_csv(url)

#### - Quantidade de valores ausentes por coluna:

In [7]:
df.isnull().sum()

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

#### - Coluna com maior quantidade de dados ausentes:

In [8]:
coluna_mais_ausentes = df.isnull().sum().idxmax()
print("A Coluna com maior quantidade de dados ausentes é a", coluna_mais_ausentes)

A Coluna com maior quantidade de dados ausentes é a Luggage.room

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 7
#### Obtenha a primeira coluna ’a’ em df como um dataframe (em vez de uma série).
`df = pd.DataFrame(np.arange(20).reshape(−1, 5), columns=list('abcde'))`
<hr>

In [9]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [10]:
coluna_a = df["a"] #selecionando a coluna "a"
coluna_a = pd.DataFrame(coluna_a) #transformando a coluna "a" em dataframe
coluna_a

    a
0   0
1   5
2  10
3  15

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 8
#### Como alterar a ordem das colunas de um dataframe? Para isso, respondam as três questões:
`df = pd.DataFrame(np.arange(20).reshape(−1, 5), columns=list('abcde'))`
<hr>

In [11]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

#### (A) Em df, troque as colunas ’a’ e ’c’

In [12]:
df = df[["c","b","a","d","e"]]
df

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

#### (B) Crie uma função genérica para trocar duas colunas, sem codificar os nomes das colunas.

In [13]:
def trocar_colunas(coluna_a, coluna_b, data_frame):
    colunas = list(data_frame.columns)
    posicao_col_1 = colunas.index(coluna_a)
    posicao_col_2 = colunas.index(coluna_b)
    colunas[posicao_col_1], colunas[posicao_col_2] = colunas[posicao_col_2], colunas[posicao_col_1]
    data_frame = data_frame[colunas]
    return data_frame

In [14]:
df = trocar_colunas('a', 'c', df)
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [15]:
df = trocar_colunas('a', 'c', df)
df

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

#### (C) Classifique as colunas em ordem alfabética inversa, ou seja, coluna ’e’ primeiro até a coluna ’a’ last.

In [16]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

colunas_descendente = sorted(df.columns, reverse=True)
df = df[colunas_descendente]

df

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 9
#### Altere as configurações de exibição de Pandas ao imprimir o dataframe df mostre no máximo 10 linhas e 10 colunas.
`pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')`
<hr>

In [17]:
url = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
df = pd.read_csv(url)

pd.set_option("display.max_columns", 10)
pd.set_option("display.max_rows", 10)

df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 10
#### A partir de df , filtre o ’Manufacturer’, ’Model’ e ’Type’ para cada 20 linhas começando em 1º (linha 0).
`pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')`
<hr>

In [18]:
# RESETANDO AS CONFIGURAÇÕES DE IMPRESSÃO DO PANDAS QUE FORAM ALTERADAS NA QUESTÃO ANTERIOR
pd.reset_option('display.max_rows')
pd.reset_option('display.max_columns')

In [19]:
url = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'
df = pd.read_csv(url)
df = df[["Manufacturer", "Model", "Type"]].iloc[:20]
df

   Manufacturer       Model     Type
0         Acura     Integra    Small
1           NaN      Legend  Midsize
2          Audi          90  Compact
3          Audi         100  Midsize
4           BMW        535i  Midsize
5         Buick     Century  Midsize
6         Buick     LeSabre    Large
7         Buick  Roadmaster    Large
8         Buick     Riviera  Midsize
9      Cadillac     DeVille    Large
10     Cadillac     Seville  Midsize
11    Chevrolet    Cavalier  Compact
12    Chevrolet     Corsica  Compact
13    Chevrolet      Camaro   Sporty
14    Chevrolet      Lumina  Midsize
15    Chevrolet  Lumina_APV      Van
16    Chevrolet       Astro      Van
17    Chevrolet     Caprice    Large
18    Chevrolet    Corvette   Sporty
19          NaN    Concorde    Large

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 11
#### Obtenha as duas últimas linhas de df cuja soma da linha é maior que 100.
`df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(−1, 4))`
<hr>

In [20]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))

In [21]:
somas_das_linhas = df.sum(axis=1)
somas_maior_100 = somas_das_linhas[somas_das_linhas>100].index #linhas que possuem soma maior que 100
ultimas_linhas = somas_maior_100[-2:]#as duas ultimas linhas

df.iloc[ultimas_linhas]

    0   1   2   3
5  38  38  19  15
8  20  26  23  35

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

## QUESTÃO 12
#### Troque as linhas 1 e 2 em df.
`df = pd.DataFrame(np.arange(25).reshape(5, −1))`
<hr>

In [22]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

In [23]:
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [24]:
#trocando as linhas
linha_um = df.iloc[1].copy() #copia profunda da linha 1
df.iloc[1]= df.iloc[2] #linha 1 recebe o conteúdo da linha 2
df.iloc[2] = linha_um #linha 2 recebe a copia profunda da linha 1
df

    0   1   2   3   4
0   0   1   2   3   4
1  10  11  12  13  14
2   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)